In [4]:
import pandas as pd

In [ ]:
#INSERT

In [16]:
var=pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5],"C":[11,12,13,14,15]})
var

   A  B   C
0  1  9  11
1  2  8  12
2  3  7  13
3  4  6  14
4  5  5  15

In [ ]:
#Inserting Data

In [11]:
var.insert(1,"Python",var["A"])
var

   A  Python  Names  B
0  1       1      1  9
1  2       2      2  8
2  3       3      3  7
3  4       4      4  6
4  5       5      5  5

In [14]:
var.insert(1,"Python_1",[11,22,33,44,55])
var

   A  Python_1  Python  Names  B
0  1        11       1      1  9
1  2        22       2      2  8
2  3        33       3      3  7
3  4        44       4      4  6
4  5        55       5      5  5

In [15]:
var["python_12"]=var["A"][:3]
var

   A  Python_1  Python  Names  B  python_12
0  1        11       1      1  9        1.0
1  2        22       2      2  8        2.0
2  3        33       3      3  7        3.0
3  4        44       4      4  6        NaN
4  5        55       5      5  5        NaN

In [ ]:
#Delete

In [22]:
var.pop("C")
var

   A
0  1
1  2
2  3
3  4
4  5